{
  "risk_disclaimer": {
    "title": "IMPORTANT RISK DISCLAIMER",
    "version": "1.0",
    "date": "2025-10-29T13:04:26.338656",
    "disclaimer_text": "\n            FOREX TRADING RISK DISCLAIMER\n            \n            IMPORTANT: This Forex trading robot is provided for educational and research purposes only. \n            Forex trading involves substantial risk of loss and is not suitable for all investors.\n            \n            RISK WARNINGS:\n            \n            1. HIGH RISK INVESTMENT: Forex trading carries a high level of risk and may not be suitable for all investors.\n            \n            2. PAST PERFORMANCE: Past performance does not guarantee future results. Historical backtesting results \n               are not indicative of future performance.\n            \n            3. CAPITAL LOSS: You may lose some or all of your invested capital, therefore you should not speculate \n               with capital that you cannot afford to lose.\n            \n            4. LEVERAGE RISK: Forex trading involves leverage, which can work both for and against you.\n            \n            5. MARKET VOLATILITY: Forex markets are highly volatile and can move against your position quickly.\n            \n            6. TECHNICAL RISKS: Technical failures, internet connectivity issues, and broker problems can affect trading.\n            \n            7. REGULATORY RISKS: Forex trading regulations vary by jurisdiction and may change.\n            \n            RECOMMENDATIONS:\n            \n            1. Start with demo accounts and paper trading\n            2. Never risk more than you can afford to lose\n            3. Understand all risks before trading live\n            4. Monitor performance regularly\n            5. Have proper risk management in place\n            6. Consult with financial advisors if needed\n            7. Keep detailed records of all trades\n            \n            NO GUARANTEES:\n            \n            This trading robot makes no guarantees about:\n            - Future profitability\n            - Risk of loss\n            - Market conditions\n            - Broker performance\n            - System reliability\n            \n            USE AT YOUR OWN RISK:\n            \n            By using this trading robot, you acknowledge that you understand the risks involved \n            and agree to use it at your own risk. The developers and distributors of this software \n            are not responsible for any financial losses incurred.\n            \n            LEGAL NOTICE:\n            \n            This software is provided \"as is\" without warranty of any kind. The user assumes all \n            responsibility for the use of this software and any resulting financial outcomes.\n            ",
    "acknowledgment": "By using this software, you acknowledge that you have read, understood, and agree to this risk disclaimer."
  }
}